#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.null_resource.install_dependencies: Refreshing state... [id=7372490965596442935]
module.backend.local_file.product_config: Refreshing state... [id=eb511dece59e2398a2fccefb451c970c88dc5ade]
module.backend.data.archive_file.download_zip: Reading...
module.backend.data.archive_file.checkout_zip: Reading...
module.backend.data.archive_file.my_purchases_zip: Reading...
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.stripe_product.vst["acid-saturator"]: Refreshing state... [id=prod_U2hsGHL5y1azKn]
module.backend.data.archive_file.my_purchases_zip: Read complete after 0s [id=cdb72f57c6a904c8cfb8062b50e33356f1239e55]
module.backend.data.archive_file.checkout_zip: Read complete after 0s [id=35a359675c0e7dbcc21d22aceb891002c8c25a18]
module.backend.data.archive_file.download_zip: Read complete after 0s [id=fbef8255c1eb83c043fba717bc78b76310fbb690]
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=e9b02f517e52118061d145bcd703caedbc5e6858]
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.stripe_price.vst_price["acid-saturator"]: Refreshing state... [id=price_1T5AACDyEyPnHPBntq88QgDj]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E1D4T2JQQTCZIX]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-dev]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_V9hhjw2Y5]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-dev-195481994910]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-dev]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=g6jnm33pu7]
module.backend.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-g6jnm33pu7-DEFAULT_4XX]
module.backend.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-g6jnm33pu7-DEFAULT_5XX]
module.backend.aws_api_gateway_resource.checkout: Refreshing state... [id=hghcjv]
module.backend.aws_api_gateway_resource.download: Refreshing state... [id=e02sjc]
module.backend.aws_api_gateway_resource.my_purchases: Refreshing state... [id=pqx6tn]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 0s [id=291e2ed913da9b4f9a6c967625aeee9fc17a31a0]
module.backend.aws_api_gateway_resource.webhook: Refreshing state... [id=uilktp]
module.backend.aws_lambda_layer_version.stripe_layer: Refreshing state... [id=arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:43]
module.backend.module.checkout_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-hghcjv-OPTIONS]
module.backend.module.my_purchases_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-pqx6tn-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-e02sjc-OPTIONS]
module.backend.aws_api_gateway_method.webhook_post: Refreshing state... [id=agm-g6jnm33pu7-uilktp-POST]
module.backend.module.checkout_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-hghcjv-OPTIONS-200]
module.backend.module.checkout_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-hghcjv-OPTIONS]
module.backend.module.my_purchases_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-pqx6tn-OPTIONS]
module.backend.module.my_purchases_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-pqx6tn-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-e02sjc-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-e02sjc-OPTIONS]
module.backend.module.my_purchases_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-pqx6tn-OPTIONS-200]
module.backend.module.checkout_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-hghcjv-OPTIONS-200]
module.backend.aws_lambda_function.my_purchases: Refreshing state... [id=vstshop-my-purchases-dev]
module.backend.aws_lambda_function.stripe_webhook: Refreshing state... [id=vstshop-stripe-webhook-dev]
module.backend.module.download_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-e02sjc-OPTIONS-200]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-dev-vst-dev-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wqxx7]
module.backend.aws_api_gateway_method.download_get: Refreshing state... [id=agm-g6jnm33pu7-e02sjc-GET]
module.backend.aws_api_gateway_method.checkout_post: Refreshing state... [id=agm-g6jnm33pu7-hghcjv-POST]
module.backend.aws_api_gateway_method.my_purchases_get: Refreshing state... [id=agm-g6jnm33pu7-pqx6tn-GET]
module.backend.aws_api_gateway_integration.my_purchases_int: Refreshing state... [id=agi-g6jnm33pu7-pqx6tn-GET]
module.backend.aws_lambda_permission.api_gw_my_purchases: Refreshing state... [id=AllowExecutionFromAPIGatewayPurchases]
module.backend.aws_lambda_permission.apigw_webhook: Refreshing state... [id=AllowExecutionFromAPIGatewayWebhook]
module.backend.aws_api_gateway_integration.webhook_integration: Refreshing state... [id=agi-g6jnm33pu7-uilktp-POST]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-dev-195481994910]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.backend.aws_lambda_function.download: Refreshing state... [id=vstshop-download-dev]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E228GMNSTNHTAD]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=2p1utd8g6jkts9qp59n7b5k9le]
module.backend.aws_lambda_function.checkout: Refreshing state... [id=vstshop-checkout-dev]
module.backend.aws_lambda_permission.apigw_download: Refreshing state... [id=AllowExecutionFromAPIGatewayDownload]
module.backend.aws_api_gateway_integration.download_integration: Refreshing state... [id=agi-g6jnm33pu7-e02sjc-GET]
module.backend.aws_lambda_permission.apigw_checkout: Refreshing state... [id=AllowExecutionFromAPIGatewayCheckout]
module.backend.aws_api_gateway_integration.checkout_integration: Refreshing state... [id=agi-g6jnm33pu7-hghcjv-POST]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=oaiyk5]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-g6jnm33pu7-dev]
local_file.env_file: Refreshing state... [id=5cacdca0f69b1a55129dfb1dd224bff74afe8b49]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.env_file will be created
  + resource "local_file" "env_file" {
      + content              = <<-EOT
            VITE_AWS_REGION=us-east-2
            VITE_USER_POOL_ID=us-east-2_V9hhjw2Y5
            VITE_USER_POOL_CLIENT_ID=2p1utd8g6jkts9qp59n7b5k9le
            VITE_API_URL=https://g6jnm33pu7.execute-api.us-east-2.amazonaws.com/dev
            VITE_CLOUDFRONT_URL=https://d1wvzswkwpl98j.cloudfront.net
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../../../../services/vstshop-frontend/.env"
      + id                   = (known after apply)
    }

  # module.backend.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-g6jnm33pu7-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-g6jnm33pu7-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_lambda_function.checkout will be updated in-place
  ~ resource "aws_lambda_function" "checkout" {
        id                             = "vstshop-checkout-dev"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:43",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.stripe_webhook will be updated in-place
  ~ resource "aws_lambda_function" "stripe_webhook" {
        id                             = "vstshop-stripe-webhook-dev"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:43",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_layer_version.stripe_layer must be replaced
+/- resource "aws_lambda_layer_version" "stripe_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:43" -> (known after apply)
      ~ code_sha256                 = "HWZQ5qryCdDWUXzJ2eQv6mGf4Nkg3KWN8vY9+KKubqQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-27T04:17:00.210+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:43" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "HWZQ5qryCdDWUXzJ2eQv6mGf4Nkg3KWN8vY9+KKubqQ=" -> "XaQ61kG7ayllVUddDoagKiGUN60WsEFG3hiIFw6mn0Q=" # forces replacement
      ~ source_code_size            = 4679081 -> (known after apply)
      ~ version                     = "43" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.backend.local_file.product_config will be created
  + resource "local_file" "product_config" {
      + content              = jsonencode(
            [
              + {
                  + id        = "acid-saturator"
                  + imagePath = "product-media/acid-saturator-gui.png"
                  + name      = "Acid Saturator"
                  + price     = "$12.99"
                  + youtubeId = "dQw4w9WgXcQ"
                },
            ]
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../../modules/vstshop/backend/../../../../services/vstshop-frontend/src/product_config.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>